EthanWu87/HOLTEK_Image_Classification_Project/v1.0.0/Firmware/HT32F493x5_FWLib_V1.2.2_184/project/ht32f49395_sk/examples/sdio/sdio_fatfs/src/ht32_sdio.c
/*********************************************************************************************************//**
 * @file    ht32_sdio.c
 * @version $Rev:: 165         $
 * @date    $Date:: 2025-09-05 #$
 * @brief   this file provides a set of functions needed to manage the
 *          sdio/mmc card memory.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

#include <string.h>
#include "ht32_sdio.h"
#include "ht32f493x5_board.h"

/** @addtogroup HT32F493x5_periph_examples
  * @{
  */

/** @addtogroup HT32F493x5_SDIO_sdio_fatfs
  * @{
  */

sdio_command_struct_type sdio_command_init_struct;
sdio_data_struct_type sdio_data_init_struct;

static sd_memory_card_type card_type = SDIO_STD_CAPACITY_SD_CARD_V1_1; /* sd card type */
static uint32_t csd_table[4], cid_table[4], rca = 0; /* csd, sid, rca */
static uint32_t ext_csd_table[128];
static sd_data_transfer_mode_type device_mode = SD_TRANSFER_POLLING_MODE; /* working mode */
static uint8_t stop_flag = 0; /* transmit stop flag */
volatile sd_error_status_type transfer_error = SD_OK; /* transmit error flag */
volatile uint8_t transfer_end = 0; /* transmit end flag */
sd_card_info_struct_type sd_card_info; /* sd card information */

sd_error_status_type command_error(void);
sd_error_status_type command_rsp1_error(uint8_t cmd);
sd_error_status_type command_rsp2_error(void);
sd_error_status_type command_rsp3_error(void);
sd_error_status_type command_rsp4_error(uint8_t cmd);
sd_error_status_type command_rsp5_error(uint8_t cmd);
sd_error_status_type command_rsp6_error(uint8_t cmd, uint16_t *p_rca);
sd_error_status_type command_rsp7_error(void);
sd_error_status_type sd_bus_wide_enable(confirm_state new_state);
sd_error_status_type mmc_switch(uint8_t set, uint8_t index, uint8_t value);
sd_error_status_type sd_switch(uint32_t mode, uint32_t group, uint8_t value, uint8_t *rsp);
sd_error_status_type check_card_programming(uint8_t *p_status);
sd_error_status_type speed_change(uint8_t speed);
sd_error_status_type get_ext_csd(void);
sd_error_status_type scr_find(void);
uint8_t convert_from_bytes_to_power_of_two(uint16_t number_of_bytes);

/**
  * @brief  initializes the sd card and put it into standby state (ready for data
  *         transfer).
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_init(void)
{
  uint16_t clkdiv = 0;
  sd_error_status_type status = SD_OK;
  gpio_init_type gpio_init_struct = {0};
  uint8_t retry = 0;

  /* gpioc and gpiod periph clock enable */
  crm_periph_clock_enable(CRM_GPIOC_PERIPH_CLOCK, TRUE);
  crm_periph_clock_enable(CRM_GPIOD_PERIPH_CLOCK, TRUE);

  /* sdio periph clock enable */
  crm_periph_clock_enable(CRM_SDIO1_PERIPH_CLOCK, TRUE);

  /* configure pc.08, pc.09, pc.10, pc.11, pc.12 pin: d0, d1, d2, d3, clk pin */
  gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
  gpio_init_struct.gpio_mode = GPIO_MODE_MUX;
  gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  gpio_init_struct.gpio_pins = GPIO_PINS_8 | GPIO_PINS_9 | GPIO_PINS_10 | GPIO_PINS_11 | GPIO_PINS_12;
  gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOC, &gpio_init_struct);

  /* configure pd.02 cmd line */
  gpio_init_struct.gpio_pins = GPIO_PINS_2;
  gpio_init(GPIOD, &gpio_init_struct);

  retry = 3;
  while(retry--){
    /* reset sdio */
    sdio_reset(SDIOx);
    /* power on */
    status = sd_power_on();

    if(status == SD_OK)
      break;
  }

  if(status == SD_OK)
  {
    /* sdio card initialize */
    status = sd_card_init();
  }

  if(status == SD_OK)
  {
    /* get card information*/
    status = sd_card_info_get(&sd_card_info);
  }

  if((SDIO_MULTIMEDIA_CARD == card_type) && (sd_card_info.sd_csd_reg.spec_version >= 4))
  {
    card_type = SDIO_HIGH_SPEED_MULTIMEDIA_CARD;
    sd_card_info.card_type = (uint8_t)card_type;
  }

  if(status == SD_OK)
  {
    /* select card */
    status = sd_deselect_select((uint32_t)(sd_card_info.rca << 16));
  }
  
  if(status == SD_OK)
  {
    if(SDIO_HIGH_SPEED_MULTIMEDIA_CARD == card_type)
    {
      if(sd_card_info.sd_csd_reg.device_size == 0xFFF)
      {
        uint32_t  sec_count; 
        /* get ext_csd function for support emmc card. */
        status = get_ext_csd();
        if(status == SD_OK)
        {
          card_type = SDIO_HIGH_CAPACITY_MMC_CARD;
          sd_card_info.card_type = (uint8_t)card_type;
          sec_count = ext_csd_table[212/4];
          sd_card_info.card_capacity = (uint64_t)sec_count*512;
        }
      }
    }
  }
  
  if(status == SD_OK && ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == card_type) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == card_type) || \
    (SDIO_SECURE_DIGITAL_IO_COMBO_CARD == card_type) || (SDIO_HIGH_CAPACITY_SD_CARD == card_type)))
  {
    status = scr_find();
  }

  if(status == SD_OK)
  {
    /* set normal speed */
    status = speed_change(0);
  }

  if((status == SD_OK) || (card_type == SDIO_MULTIMEDIA_CARD))
  {
    if(sd_card_info.card_type == SDIO_STD_CAPACITY_SD_CARD_V1_1 || sd_card_info.card_type == SDIO_STD_CAPACITY_SD_CARD_V2_0)
    {
      /* set sdio_ck to 12mhz */
      clkdiv = system_core_clock / 12000000;

      if(clkdiv >= 2)
      {
        clkdiv -= 2;
      }
    }
    else
    {
      /* set sdio_ck to 25mhz */
      clkdiv = system_core_clock / 25000000;

      if(clkdiv >= 2)
      {
        clkdiv -= 2;
      }
    }
    /* set sdio clock divider */
    sdio_clock_set(clkdiv);

