EthanWu87/HOLTEK_Image_Classification_Project/v1.0.0/Firmware/HT32F493x5_FWLib_V1.2.2_184/project/ht32f49395_sk/examples/sdio/sdio_fatfs/src/ht32_sdio.c
    card_info->sd_csd_reg.max_read_current_vdd_min = (tmp & 0x38) >> 3;
    card_info->sd_csd_reg.max_read_current_vdd_max = (tmp & 0x07);

    /* byte 9 */
    tmp = (uint8_t)((csd_table[2] & 0x00FF0000) >> 16);
    card_info->sd_csd_reg.max_write_current_vdd_min = (tmp & 0xE0) >> 5;
    card_info->sd_csd_reg.max_write_current_vdd_max = (tmp & 0x1C) >> 2;
    card_info->sd_csd_reg.device_size_mult = (tmp & 0x03) << 1;
    /* byte 10 */
    tmp = (uint8_t)((csd_table[2] & 0x0000FF00) >> 8);
    card_info->sd_csd_reg.device_size_mult |= (tmp & 0x80) >> 7;

    card_info->card_capacity = (card_info->sd_csd_reg.device_size + 1) ;
    card_info->card_capacity *= (1 << (card_info->sd_csd_reg.device_size_mult + 2));
    card_info->card_blk_size = 1 << (card_info->sd_csd_reg.max_read_blk_length);
    card_info->card_capacity *= card_info->card_blk_size;
  }
  else if(card_type == SDIO_HIGH_CAPACITY_SD_CARD)
  {
    /* byte 7 */
    tmp = (uint8_t)(csd_table[1] & 0x000000FF);
    card_info->sd_csd_reg.device_size = (tmp & 0x3F) << 16;

    /* byte 8 */
    tmp = (uint8_t)((csd_table[2] & 0xFF000000) >> 24);

    card_info->sd_csd_reg.device_size |= (tmp << 8);

    /* byte 9 */
    tmp = (uint8_t)((csd_table[2] & 0x00FF0000) >> 16);

    card_info->sd_csd_reg.device_size |= (tmp);

    /* byte 10 */
    tmp = (uint8_t)((csd_table[2] & 0x0000FF00) >> 8);

    card_info->card_capacity = (uint64_t)(card_info->sd_csd_reg.device_size + 1) * 512 * 1024;
    card_info->card_blk_size = 512;
  }


  card_info->sd_csd_reg.erase_group_size = (tmp & 0x40) >> 6;
  card_info->sd_csd_reg.erase_group_size_mult = (tmp & 0x3F) << 1;

  /* byte 11 */
  tmp = (uint8_t)(csd_table[2] & 0x000000FF);
  card_info->sd_csd_reg.erase_group_size_mult |= (tmp & 0x80) >> 7;
  card_info->sd_csd_reg.write_protect_group_size = (tmp & 0x7F);

  /* byte 12 */
  tmp = (uint8_t)((csd_table[3] & 0xFF000000) >> 24);
  card_info->sd_csd_reg.write_protect_group_enable = (tmp & 0x80) >> 7;
  card_info->sd_csd_reg.manufacturer_default_ecc = (tmp & 0x60) >> 5;
  card_info->sd_csd_reg.write_speed_factor = (tmp & 0x1C) >> 2;
  card_info->sd_csd_reg.max_write_blk_length = (tmp & 0x03) << 2;

  /* byte 13 */
  tmp = (uint8_t)((csd_table[3] & 0x00FF0000) >> 16);
  card_info->sd_csd_reg.max_write_blk_length |= (tmp & 0xC0) >> 6;
  card_info->sd_csd_reg.part_blk_write = (tmp & 0x20) >> 5;
  card_info->sd_csd_reg.reserved3 = 0;
  card_info->sd_csd_reg.content_protect_app = (tmp & 0x01);

  /* byte 14 */
  tmp = (uint8_t)((csd_table[3] & 0x0000FF00) >> 8);
  card_info->sd_csd_reg.file_format_group = (tmp & 0x80) >> 7;
  card_info->sd_csd_reg.copy_flag = (tmp & 0x40) >> 6;
  card_info->sd_csd_reg.permanent_write_protect = (tmp & 0x20) >> 5;
  card_info->sd_csd_reg.temp_write_protect = (tmp & 0x10) >> 4;
  card_info->sd_csd_reg.file_formart = (tmp & 0x0C) >> 2;
  card_info->sd_csd_reg.ecc_code = (tmp & 0x03);

  /* byte 15 */
  tmp = (uint8_t)(csd_table[3] & 0x000000FF);
  card_info->sd_csd_reg.csd_crc = (tmp & 0xFE) >> 1;
  card_info->sd_csd_reg.reserved4 = 1;

  /* byte 0 */
  tmp = (uint8_t)((cid_table[0] & 0xFF000000) >> 24);
  card_info->sd_cid_reg.manufacturer_id = tmp;

  /* byte 1 */
  tmp = (uint8_t)((cid_table[0] & 0x00FF0000) >> 16);
  card_info->sd_cid_reg.oem_app_id = tmp << 8;

  /* byte 2 */
  tmp = (uint8_t)((cid_table[0] & 0x000000FF00) >> 8);
  card_info->sd_cid_reg.oem_app_id |= tmp;

  /* byte 3 */
  tmp = (uint8_t)(cid_table[0] & 0x000000FF);
  card_info->sd_cid_reg.product_name1 = tmp << 24;

  /* byte 4 */
  tmp = (uint8_t)((cid_table[1] & 0xFF000000) >> 24);
  card_info->sd_cid_reg.product_name1 |= tmp << 16;

  /* byte 5 */
  tmp = (uint8_t)((cid_table[1] & 0x00FF0000) >> 16);
  card_info->sd_cid_reg.product_name1 |= tmp << 8;

  /* byte 6 */
  tmp = (uint8_t)((cid_table[1] & 0x0000FF00) >> 8);
  card_info->sd_cid_reg.product_name1 |= tmp;

  /* byte 7 */
  tmp = (uint8_t)(cid_table[1] & 0x000000FF);
  card_info->sd_cid_reg.product_name2 = tmp;

  /* byte 8 */
  tmp = (uint8_t)((cid_table[2] & 0xFF000000) >> 24);
  card_info->sd_cid_reg.product_reversion = tmp;

  /* byte 9 */
  tmp = (uint8_t)((cid_table[2] & 0x00FF0000) >> 16);
  card_info->sd_cid_reg.product_sn = tmp << 24;

  /* byte 10 */
  tmp = (uint8_t)((cid_table[2] & 0x0000FF00) >> 8);
  card_info->sd_cid_reg.product_sn |= tmp << 16;

  /* byte 11 */
  tmp = (uint8_t)(cid_table[2] & 0x000000FF);
  card_info->sd_cid_reg.product_sn |= tmp << 8;

  /* byte 12 */
  tmp = (uint8_t)((cid_table[3] & 0xFF000000) >> 24);
  card_info->sd_cid_reg.product_sn |= tmp;

  /* byte 13 */
  tmp = (uint8_t)((cid_table[3] & 0x00FF0000) >> 16);
  card_info->sd_cid_reg.reserved1 |= (tmp & 0xF0) >> 4;
  card_info->sd_cid_reg.manufact_date = (tmp & 0x0F) << 8;

  /* byte 14 */
  tmp = (uint8_t)((cid_table[3] & 0x0000FF00) >> 8);
  card_info->sd_cid_reg.manufact_date |= tmp;

  /* byte 15 */
  tmp = (uint8_t)(cid_table[3] & 0x000000FF);
  card_info->sd_cid_reg.cid_crc = (tmp & 0xFE) >> 1;
  card_info->sd_cid_reg.reserved2 = 1;

  return(status);
}

/**
  * @brief  enable wide bus opeartion for the requeseted card if supported by
  *         card.
  * @param  mode: specifies the sd card wide bus mode.
  *   this parameter can be one of the following values:
  *     @arg SDIO_BUS_WIDTH_D8: 8-bit data transfer (only for mmc)
  *     @arg SDIO_BUS_WIDTH_D4: 4-bit data transfer
  *     @arg SDIO_BUS_WIDTH_D1: 1-bit data transfer
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_wide_bus_operation_config(sdio_bus_width_type mode)
{
  sd_error_status_type status = SD_OK;

  if(card_type == SDIO_MULTIMEDIA_CARD || card_type == SDIO_HIGH_SPEED_MULTIMEDIA_CARD || card_type == SDIO_HIGH_CAPACITY_MMC_CARD)
  {
    status = mmc_switch(EXT_CSD_CMD_SET_NORMAL, EXT_CSD_BUS_WIDTH, (uint8_t)mode);
  }
  else if((card_type == SDIO_STD_CAPACITY_SD_CARD_V1_1) || (card_type == SDIO_STD_CAPACITY_SD_CARD_V2_0) || \
          (card_type == SDIO_HIGH_CAPACITY_SD_CARD))
  {
    if(mode >= 2)
    {
      /* not support D8 mode */
      return SD_UNSUPPORTED_FEATURE;
    }

