EthanWu87/HOLTEK_Image_Classification_Project/v1.0.0/Firmware/HT32F493x5_FWLib_V1.2.2_184/project/ht32f49395_sk/examples/sdio/sdio_fatfs/src/ht32_sdio.c
    while(!(SDIOx->sts & SDIOx->inten) && timeout)
    {
      timeout--;

      if(transfer_end)
      {
        break;
      }
    }

    if(timeout == 0)
    {
      sd_init();
      return SD_DATA_TIMEOUT;
    }

    if(transfer_error != SD_OK)
    {
      status = transfer_error;
    }
  }

  return status;
}

/**
  * @brief  erase continuous data block
  * @param  addr: starting address
  * @param  nblks: amount of erasing data block
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_blocks_erase(long long addr, uint32_t nblks)
{
  sd_error_status_type status = SD_OK;
  uint32_t start_addr = 0, end_addr = 0, response = 0;
  uint8_t card_state;

  /* high capacity sd card */
  if(card_type == SDIO_HIGH_CAPACITY_SD_CARD)
  {
    start_addr = addr >> 9;
    end_addr = start_addr + nblks - 1;
  }
  else
  {
    start_addr = addr;
    end_addr = start_addr + (nblks - 1) * 512;
  }

  /* clear dcsm configuration */
  sdio_data_init_struct.block_size = SDIO_DATA_BLOCK_SIZE_1B;
  sdio_data_init_struct.data_length = 0 ;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT ;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  sdio_data_config(SDIOx, &sdio_data_init_struct);
  sdio_data_state_machine_enable(SDIOx, FALSE);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  /* check card locked */
  if(response & SD_CARD_LOCKED)
  {
    return SD_LOCK_UNLOCK_ERROR;
  }

  if(card_type == SDIO_MULTIMEDIA_CARD || card_type == SDIO_HIGH_SPEED_MULTIMEDIA_CARD || card_type == SDIO_HIGH_CAPACITY_MMC_CARD)
  {
    /* send cmd35, set erase group start */
    sdio_command_init_struct.argument =  start_addr;
    sdio_command_init_struct.cmd_index = SD_CMD_ERASE_GRP_START;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_ERASE_GRP_START);

    if(status != SD_OK)
    {
      return status;
    }

    /* send cmd36, set erase group end */
    sdio_command_init_struct.argument =  end_addr;
    sdio_command_init_struct.cmd_index = SD_CMD_ERASE_GRP_END;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_ERASE_GRP_END);

    if(status != SD_OK)
    {
      return status;
    }

    /* send cmd38, start erase gourp */
    sdio_command_init_struct.argument =  0;
    sdio_command_init_struct.cmd_index = SD_CMD_ERASE;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_ERASE);

    if(status != SD_OK)
    {
      return status;
    }
  }
  else
  {
    /* send cmd32, set erase block start */
    sdio_command_init_struct.argument =  start_addr;
    sdio_command_init_struct.cmd_index = SD_CMD_SD_ERASE_GRP_START;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_SD_ERASE_GRP_START);

    if(status != SD_OK)
    {
      return status;
    }

    /* send cmd33, set erase block end */
    sdio_command_init_struct.argument =  end_addr;
    sdio_command_init_struct.cmd_index = SD_CMD_SD_ERASE_GRP_END;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    if(status != SD_OK)
    {
      return status;
    }

    /* send cmd38, start erase block */
    sdio_command_init_struct.argument =  0;
    sdio_command_init_struct.cmd_index = SD_CMD_ERASE;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_ERASE);

    if(status != SD_OK)
    {
      return status;
    }
  }

  status = check_card_programming(&card_state);

  while((status == SD_OK) && ((card_state == SD_CARD_PROGRAMMING) || \
        (card_state == SD_CARD_RECEIVING)))
  {
    status = check_card_programming(&card_state);
  }

  return status;
}

/**
  * @brief  allows to read one block from a specified address in a card. the data
  *         transfer can be managed by dma mode or polling mode.
  * @param  buf: pointer to the buffer that will contain the received data
  * @param  addr: address from where data are to be read.
  * @param  blk_size: the sd card data block size. the block size should be 512.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_block_read(uint8_t *buf, long long addr, uint16_t blk_size)
{
  sd_error_status_type status = SD_OK;
  uint32_t response = 0;
  uint8_t power;

  if(NULL == buf)
  {
    return SD_INVALID_PARAMETER;
  }

  SDIOx->dtctrl = 0x0;

  if((card_type == SDIO_HIGH_CAPACITY_SD_CARD) || (card_type == SDIO_HIGH_CAPACITY_MMC_CARD))
  {
    blk_size = 512;
    addr >>= 9;
  }

  /* clear dcsm configuration */
  sdio_data_init_struct.block_size = SDIO_DATA_BLOCK_SIZE_1B;
  sdio_data_init_struct.data_length = 0;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  sdio_data_config(SDIOx, &sdio_data_init_struct);
  sdio_data_state_machine_enable(SDIOx, FALSE);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  /* check card locked */
  if(response & SD_CARD_LOCKED)
  {
    return SD_LOCK_UNLOCK_ERROR;
  }

