EthanWu87/HOLTEK_Image_Classification_Project/v1.0.0/Firmware/HT32F493x5_FWLib_V1.2.2_184/project/ht32f49395_sk/examples/sdio/sdio_fatfs/src/ht32_sdio.c
    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_SET_BLOCKLEN);

    if(status != SD_OK)
    {
      return status;
    }
  }
  else
  {
    return SD_INVALID_PARAMETER;
  }

  timeout = SD_DATATIMEOUT;

  do
  {
    timeout--;
    status = sd_status_send(&card_status);
  }
  /* check ready_for_data flag */
  while(((card_status & 0x00000100) == 0) && (timeout > 0));

  if(timeout == 0)
  {
    return SD_ERROR;
  }

  /* send cmd24, write single block */
  sdio_command_init_struct.argument = addr;
  sdio_command_init_struct.cmd_index = SD_CMD_WRITE_SINGLE_BLOCK;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  sdio_data_init_struct.block_size = (sdio_block_size_type)(power);
  sdio_data_init_struct.data_length = blk_size;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  stop_flag = 0;

  /* single block, stop command is unnecessary */
  status = sdio_command_data_send(&sdio_command_init_struct, &sdio_data_init_struct, (uint32_t *)buf);

  if(status != SD_OK)
  {
    return status;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  status = check_card_programming(&card_state);

  while((status == SD_OK) && ((card_state == SD_CARD_PROGRAMMING) || (card_state == SD_CARD_RECEIVING)))
  {
    status = check_card_programming(&card_state);
  }

  return status;
}

/**
  * @brief  allows to write blocks starting from a specified address in a card.
  *         the data transfer can be managed by dma mode only.
  * @param  buf: pointer to the buffer that contain the data to be transferred.
  * @param  addr: address from where data are to be read.
  * @param  blk_size: the sd card data block size. the block size should be 512.
  * @param  nblks: number of blocks to be written.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_mult_blocks_write(const uint8_t *buf, long long addr, uint16_t blk_size, uint32_t nblks)
{
  sd_error_status_type status = SD_OK;
  uint8_t  power = 0, card_state = 0;
  uint32_t timeout = 0, card_status = 0, response = 0;;

  if(buf == NULL)
  {
    return SD_INVALID_PARAMETER;
  }

  SDIOx->dtctrl = 0x0;

  /* clear dcsm configuration */
  sdio_data_init_struct.block_size = (sdio_block_size_type)0;
  sdio_data_init_struct.data_length = 0;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  sdio_data_config(SDIOx, &sdio_data_init_struct);
  sdio_data_state_machine_enable(SDIOx, FALSE);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  /* check card locked */
  if(response & SD_CARD_LOCKED)
  {
    return SD_LOCK_UNLOCK_ERROR;
  }

  if((card_type == SDIO_HIGH_CAPACITY_SD_CARD) || (card_type == SDIO_HIGH_CAPACITY_MMC_CARD))
  {
    blk_size = 512;
    addr >>= 9;
  }

  if((blk_size > 0) && (blk_size <= 2048) && ((blk_size & (blk_size - 1)) == 0))
  {
    power = convert_from_bytes_to_power_of_two(blk_size);

    /* send cmd16, set block size */
    sdio_command_init_struct.argument =  blk_size;
    sdio_command_init_struct.cmd_index = SD_CMD_SET_BLOCKLEN;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_SET_BLOCKLEN);

    if(status != SD_OK)
    {
      return status;
    }
  }
  else
  {
    return SD_INVALID_PARAMETER;
  }

  if((nblks * blk_size) > SD_MAX_DATA_LENGTH)
  {
    return SD_INVALID_PARAMETER;
  }

  timeout = SD_DATATIMEOUT;

  do
  {
    timeout--;
    status = sd_status_send(&card_status);
  }
  /* check ready_for_data flag */
  while(((card_status & 0x00000100) == 0) && (timeout > 0));

  if(timeout == 0)
  {
    return SD_ERROR;
  }

  if((card_type == SDIO_STD_CAPACITY_SD_CARD_V1_1) || (card_type == SDIO_STD_CAPACITY_SD_CARD_V2_0) || \
     (card_type == SDIO_HIGH_CAPACITY_SD_CARD))
  {
    /* send cmd55 */
    sdio_command_init_struct.argument = (uint32_t)rca << 16;
    sdio_command_init_struct.cmd_index = SD_CMD_APP_CMD;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_APP_CMD);

    if(status != SD_OK)
    {
      return status;
    }

    /* send cmd23, set block count */
    sdio_command_init_struct.argument = blk_size;
    sdio_command_init_struct.cmd_index = SD_CMD_SET_BLOCK_COUNT;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_SET_BLOCK_COUNT);

    if(status != SD_OK)
    {
      return status;
    }
  }

  /* send cmd25, write mult blocks */
  sdio_command_init_struct.argument = addr;
  sdio_command_init_struct.cmd_index = SD_CMD_WRITE_MULT_BLOCK;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  sdio_data_init_struct.block_size = (sdio_block_size_type)(power);
  sdio_data_init_struct.data_length = nblks * blk_size ;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT ;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  stop_flag = 1;
  /* cmd12 is needed */
  status = sdio_command_data_send(&sdio_command_init_struct, &sdio_data_init_struct, (uint32_t *)buf);

  if(status != SD_OK)
  {
    return status;
  }

