EthanWu87/HOLTEK_Image_Classification_Project/v1.0.0/Firmware/HT32F493x5_FWLib_V1.2.2_184/project/ht32f49395_sk/examples/sdio/sdio_fatfs/src/ht32_sdio.c
  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  sts_reg = SDIOx->sts;

  while(!(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG)))
  {
    sts_reg = SDIOx->sts;
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDFAIL_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDFAIL_FLAG);
    return SD_CMD_FAIL;
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDTIMEOUT_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);
    return SD_CMD_RSP_TIMEOUT;
  }

  rsp_cmd = sdio_command_response_get(SDIOx);
  if(rsp_cmd!= SD_CMD_SEND_STATUS)
  {
    return SD_ILLEGAL_CMD;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  *p_status = (uint8_t)((response >> 9) & 0x0000000F);

  return SD_OK;
}

/**
  * @brief  read current card status.
  * @param  p_card_status: card status.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_status_send(uint32_t *p_card_status)
{
  sd_error_status_type status = SD_OK;

  if(p_card_status == NULL)
  {
    status = SD_INVALID_PARAMETER;
    return status;
  }

  sdio_command_init_struct.argument = (uint32_t)(rca << 16);
  sdio_command_init_struct.cmd_index = SD_CMD_SEND_STATUS;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  status = command_rsp1_error(SD_CMD_SEND_STATUS);

  if(status != SD_OK)
  {
    return status;
  }

  *p_card_status = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  return status;
}

/**
  * @brief  returns information about sd card.
  * @param  none.
  * @retval sd_card_state_type: sd card state code.
  */
sd_card_state_type sd_state_get(void)
{
  uint32_t response = 0;

  if(sd_status_send(&response) != SD_OK)
  {
    return SD_CARD_ERROR;
  }
  else
  {
    return (sd_card_state_type)((response >> 9) & 0x0F);
  }
}

/**
  * @brief  find the sd card ext csd register value.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type get_ext_csd(void)
{
  uint32_t index = 0, sts_reg = 0;
  sd_error_status_type status = SD_OK;
  uint32_t *tmp_ext_csd = ext_csd_table;

  sdio_data_init_struct.block_size = SDIO_DATA_BLOCK_SIZE_512B;
  sdio_data_init_struct.data_length = 512;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CONTROLLER;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  sdio_data_config(SDIOx, &sdio_data_init_struct);
  sdio_data_state_machine_enable(SDIOx, TRUE);

  /* send cmd8 */
  sdio_command_init_struct.argument = 0x0;
  sdio_command_init_struct.cmd_index = SD_CMD_HS_SEND_EXT_CSD;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;
  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);
  status = command_rsp1_error(SD_CMD_HS_SEND_EXT_CSD);
  if(status != SD_OK)
  {
    return status;
  }

  sts_reg = SDIOx->sts;
  
  while(!(sts_reg & (SDIO_RXERRO_FLAG | SDIO_DTFAIL_FLAG | SDIO_DTTIMEOUT_FLAG | SDIO_DTBLKCMPL_FLAG | SDIO_SBITERR_FLAG)))
  {
    if(sdio_flag_get(SDIOx, SDIO_RXBUF_FLAG) != RESET)
    {
      *(tmp_ext_csd + index) = sdio_data_read(SDIOx);
      index++;
    }
    sts_reg = SDIOx->sts;
  }
  if(sdio_flag_get(SDIOx, SDIO_DTTIMEOUT_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_DTTIMEOUT_FLAG);
    return SD_DATA_TIMEOUT;
  }
  else if(sdio_flag_get(SDIOx, SDIO_DTFAIL_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_DTFAIL_FLAG);
    return SD_DATA_FAIL;
  }
  else if(sdio_flag_get(SDIOx, SDIO_RXERRO_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_RXERRO_FLAG);
    return SD_RX_OVERRUN;
  }
  else if(sdio_flag_get(SDIOx, SDIO_SBITERR_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_SBITERR_FLAG);
    return SD_START_BIT_ERR;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);
  
  return status;
}

/**
  * @brief  find the sd card scr register value.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type scr_find(void)
{
  uint32_t index = 0, sts_reg = 0;
  sd_error_status_type status = SD_OK;
  uint32_t *tempscr;

  tempscr = (uint32_t *) &(sd_card_info.sd_scr_reg);

  /* send cmd16, set block length */
  sdio_command_init_struct.argument = (uint32_t)8;
  sdio_command_init_struct.cmd_index = SD_CMD_SET_BLOCKLEN;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  status = command_rsp1_error(SD_CMD_SET_BLOCKLEN);

  if(status != SD_OK)
  {
    return status;
  }

  /* send cmd55 */
  sdio_command_init_struct.argument = (uint32_t)(sd_card_info.rca << 16);
  sdio_command_init_struct.cmd_index = SD_CMD_APP_CMD;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  status = command_rsp1_error(SD_CMD_APP_CMD);

  if(status != SD_OK)
  {
    return status;
  }

  sdio_data_init_struct.block_size = SDIO_DATA_BLOCK_SIZE_8B;
  sdio_data_init_struct.data_length = 8;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CONTROLLER;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  sdio_data_config(SDIOx, &sdio_data_init_struct);
  sdio_data_state_machine_enable(SDIOx, TRUE);

  /* send cmd51 */
  sdio_command_init_struct.argument = 0x0;
  sdio_command_init_struct.cmd_index = SD_CMD_SD_APP_SEND_SCR;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

